Revit 2027 API
IFCHybridImportOptions Properties
The IFCHybridImportOptions type exposes the following members.
Properties
Name | Description
HybridGrids |  True if we should use AnyCAD to process grids, false otherwise.
HybridLevels |  True if we should use AnyCAD to process levels, false otherwise.
HybridPropertySets |  True if we should use AnyCAD to process property sets, false otherwise.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
IFCHybridImportOptions Class
Autodesk.Revit.DB.IFC Namespace